---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopTermination
source: html/751e2f28-e0b6-30a6-2ac4-8a3abf82d39c.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopTermination Property

The termination of the rail at the end or top.

## Syntax (C#)
```csharp
public ElementId EndOrTopTermination { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The termination is not a valid termination symbol for continuous rail.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null